[app]

# (string) اسم التطبيق الذي سيظهر للمستخدمين على شاشة الهاتف بعد التثبيت
title = VPN Hotspot Sharer

# (string) اسم الحزمة البرمجية (بدون مسافات أو رموز خاصة)
package.name = vpnhotspotsharer

# (string) النطاق الخاص بك (يمكنك تركه كالتالي أو وضع رابط حسابك)
package.domain = org.github.hak78

# (string) مسار الملف البرمجي الأساسي (يجب أن يكون app.py الموجود في مستودعك)
source.dir = .

# (list) امتدادات الملفات التي يجب تضمينها داخل حزمة الـ APK
source.include_exts = py,png,jpg,kv,atlas

# (string) إصدار التطبيق الحالي
version = 1.0.0

# (list) المكتبات البرمجية التي يعتمد عليها التطبيق (أهمها kivy و python3 مع تثبيت إصدار متوافق)
requirements = python3,kivy,requests==2.32.3,charset-normalizer==3.4.3

# (list) الأذونات البرمجية التي يحتاجها التطبيق ليعمل في نظام أندرويد
# يحتاج التطبيق للإنترنت وحالة الشبكة لتمرير البروكسي بنجاح
android.permissions = INTERNET, ACCESS_NETWORK_STATE, ACCESS_WIFI_STATE

# (string) اتجاه الشاشة المدعوم (إجباري هنا ليكون عمودياً كمظهر الهاتف الطبيعي)
orientation = portrait

# -----------------------------------------------------------------------------
# إعدادات متقدمة لبناء الحزمة (تلقائية)
# -----------------------------------------------------------------------------
[buildozer]
# (int) مستوى التنبيهات أثناء بناء حزمة الـ APK (2 تعني إظهار الأخطاء والتفاصيل بدقة)
log_level = 2

# (string) المجلد المؤقت الذي ستُبنى فيه حزمة التطبيق داخل النظام
build_dir = ./.buildozer
